# Introduction to SQLite

In [1]:
import sqlite3

In [4]:
# create a connection -> database
# connect to an exixting DB or create a new DB

conn = sqlite3.connect("example.db")

In [5]:
# create a cursor
# it allows us to run queries on the database

cur = conn.cursor()

In [6]:
# create a table

cur.execute(" CREATE TABLE customer(firstname TEXT, lastname TEXT, income REAL)")

In [8]:
# Add data
# Strings in single quote

cur.execute("Insert into customer values('AB', 'xy', 12)")

In [9]:
# to save results
conn.commit()

In [15]:
# Run a simple query

cur.execute("SELECT * from customer")

# Fetch one roq
cur.fetchone()

('AB', 'xy', 12.0)

In [16]:
for row in cur.execute("SELECT * from customer"):
    print(row)

('AB', 'xy', 12.0)

In [17]:
# Add several rows

cust_list = [('QW','WE',123),('DF','RT',68),('KJ', 'HJ', 67)]

cur.executemany("insert into customer values(?,?,?)", cust_list)

In [18]:
for row in cur.execute("SELECT * from customer"):
    print(row)

('AB', 'xy', 12.0)
('QW', 'WE', 123.0)
('DF', 'RT', 68.0)
('KJ', 'HJ', 67.0)

In [20]:
# to save results to the database
conn.commit()

In [21]:
# close the connection

conn.close()

# Run queries

In [22]:
conn = sqlite3.connect("example.db")
cur = conn.cursor()

In [26]:
cur.execute("select * from customer where firstname ='AB'")
cur.fetchall()

[('AB', 'xy', 12.0)]

In [27]:
cur.execute("select * from customer where lastname ='WE'")
cur.fetchall()

[('QW', 'WE', 123.0)]

In [28]:
# Empty list -> no results

cur.execute("select * from customer where lastname ='r'")
cur.fetchall()

[]

In [30]:
cur.execute("select * from customer order by lastname")
cur.fetchall()

[('KJ', 'HJ', 67.0),
 ('DF', 'RT', 68.0),
 ('QW', 'WE', 123.0),
 ('AB', 'xy', 12.0)]

In [36]:
cur.execute("select sum(income) from customer")
cur.fetchall()

[(270.0,)]

In [37]:
cur.execute("select sum(income) from customer")
cur.fetchone()

(270.0,)

In [ ]:
conn.close()

# Pandas With SQLite

In [ ]:
# Pandas -> panel data

In [39]:
import pandas as pd
import sqlite3

import warnings
warnings.filterwarnings("ignore")

In [40]:
conn = sqlite3.connect("example.db")

cur = conn.cursor()

In [41]:
cur.execute("select * from customer")
cur.fetchall()

[('AB', 'xy', 12.0),
 ('QW', 'WE', 123.0),
 ('DF', 'RT', 68.0),
 ('KJ', 'HJ', 67.0)]

# Creation of a dataframe

In [43]:
# output of an SQL query in the form of a dataframe

df = pd.read_sql("Select * from customer", conn)

In [44]:
df.head()

  firstname lastname  income
0        AB       xy    12.0
1        QW       WE   123.0
2        DF       RT    68.0
3        KJ       HJ    67.0

In [45]:
df = pd.read_sql_query("Select * from customer", conn)
df

  firstname lastname  income
0        AB       xy    12.0
1        QW       WE   123.0
2        DF       RT    68.0
3        KJ       HJ    67.0

In [47]:
df = pd.read_sql_query("Select * from customer order by firstname", conn)
df

  firstname lastname  income
0        AB       xy    12.0
1        DF       RT    68.0
2        KJ       HJ    67.0
3        QW       WE   123.0

# Create a table in SQLite from a CSV file using Pandas

In [51]:
df = pd.read_csv("sample.csv")

In [52]:
df.head()

      Name  Age
0    Favio   31
1    Marco   25
2      Sri   60
3      Anu   58
4  Sandeep   28

In [53]:
df.to_sql("sample_table", conn, if_exists="replace", index=False)

In [56]:
pd.read_sql("select * from sample_table", conn)

      Name  Age
0    Favio   31
1    Marco   25
2      Sri   60
3      Anu   58
4  Sandeep   28

# Function to get table info

In [60]:
conn = sqlite3.connect("example.db")
cur=conn.cursor()

In [78]:
def table_info(conn, cur):
    tables = cur.execute("select * from sqlite_master where type='table';").fetchall()
    
    for table_name in tables:
        table_name = table_name[1]
        print(table_name)
        
        #table = pd.read_sql("select * from {} limit 0".format(table_name), conn)
        
        for col in table.columns:
            print("\t " + col)
        print()

In [79]:
table_info(conn, cur)

customer
	 firstname
	 lastname
	 income

sample_table
	 Name
	 Age

# Schema of the tables

In [80]:
cur.execute(" PRAGMA table_info('customer')").fetchall()

[(0, 'firstname', 'TEXT', 0, None, 0),
 (1, 'lastname', 'TEXT', 0, None, 0),
 (2, 'income', 'REAL', 0, None, 0)]

#### Every row
- Index
- Column name
- Data type
- Can be NULL? 0-> can be NULL
- Default value
- Primary key?  0-> Not primary key